{
  "pageSize": 3,
  "pageNumber": 2,
  "totalPages": 3,
  "posts": [
    {
      "id": "phyllotaxis",
      "title": "Phyllotaxis",
      "text": "The regular arrangement of lateral organs (leaves on a stem, scales on a cone axis, florets in a composite flower head) is an important aspect of plant form, known as _phyllotaxis_. The extensive literature generated by biologists’ and mathematicians’ interest in phyllotaxis is reviewed by Erickson [36] and Jean [78]. The proposed models range widely from purely geometric descriptions (for example, Coxeter [17]) to complex physiological hypotheses tested by computer simulations (Hellendoorn and Lindenmayer [59], Veen and Lindenmayer [151], Young [163]). This chapter presents two models suitable for the synthesis of realistic images of flowers and fruits that exhibit spiral phyllotactic patterns.",
      "created": "2022-04-12 13:03:00",
      "author": "dime",
      "tags": [
        "modeling"
      ]
    },
    {
      "id": "the-planar-model",
      "title": "The planar model",
      "text": "The distribution of florets described by formula (4.1) is shown in Figure\n4.1. The square-root relationship between the distance r and the Model\nfloret ordering number n has a simple geometric explanation. Assum- justification\ning that all florets have the same size and are densely packed, the total\nnumber of florets that fit inside a disc of radius r is proportional to\nthe disk area. Thus, the ordering number n of the most outwardly\npositioned floret in the capitulum is proportional to r2, or r ∼\n√\nn.\nThe divergence angle of 137.5◦ is much more difficult to explain.\nVogel [154] derives it using two assumptions.",
      "created": "2022-04-05 12:14:31",
      "author": "dime"
    },
    {
      "id": "sunflower-head",
      "title": "Sunflower head",
      "text": "Other extensions to the basic model consist of varying organ orientation\nin space and changing their altitude from the plane of the head\nas a function of n. For example, the sunflower plants included in Figure\n4.5 have flowers in four developmental stages: buds, young flowers\nstarting to open, open flowers and older flowers where the petals begin\nto droop. All flowers are generated using approximately the same number\nof florets. The central florets are represented by the same surface at\neach stage. The shape and orientation of surfaces representing petals\nvary from one stage to another. The plants have been modeled as dibotryoids,\nwith a single signal inducing a basipetal flowering sequence,\nas described in the previous chapter.",
      "created": "2022-03-31 08:00:34",
      "author": "dime"
    }
  ],
  "availableTags": [
    {
      "name": "modeling",
      "count": 3
    },
    {
      "name": "surface",
      "count": 5
    },
    {
      "name": "shape",
      "count": 1
    }
  ]
}